{
  "name": "Abdul Mannan",
  "email": "abdulmannan.siapi@gmail.com",
  "profiles": "https://linkedin.com/in/abdulmannansaipi",
  "experience": "Full Stack Developer Intern \" PT Mattel Indonesia\nBekasi Regancy, Indonesia\nJanuary 2024 - present\nSpearheaded the digital transformation of manual processes, replacing paper-based and Excel-based\nsystems with automated solutions to enhance efficiency and accuracy.\nDesigned, built, and deployed over ten bespoke systems tailored to various departmental needs, utilizing\nASP.NET, Power Apps, and Power Automate, C#, VB, and SQL Server, which resulted in significant\nimprovements in workflow efficiency and employee productivity.\nManaged and maintained company data through SQL Server for database management and Power BI for\ndata visualization and reporting. Integrated Gateway to streamline data accessibility, enabling informed\ndecision-making and enhancing data security.\nIT Programmer Intern \" Sekretariat Jendral DPR RI\nCentral Jakarta, Indonesia\nAugust – December 2023\nDeveloped a data visualization application like Tableau/Power BI using Laravel and SQL, enabling users to\ncreate custom dashboards with a variety of charts. Users can select and arrange charts according to their\npreferences, offering a highly adaptable and personalized experience.\nDesigned an efficient data retrieval system (scheduler) using Node.js, which periodically updates a smaller\ndataset from the main database, ensuring faster query times for the dashboard website.\nPlayed a key role in designing the infrastructure for the \"Improvisasi Dashboard Website Program Legislasi\nNasional DPR\" proposal. This included system design, architectural design, detailed design, use case\ndiagrams, activity diagrams, and entity relationship diagrams, with a focus on improving the efficiency and\naccountability of the DPR website using the RUU dataset.",
  "education": "President University\nBCs in Informatics (Current GPA: 3.88)\nCikarang, West Java\nSep 2021 – Dec 2024 (Expected)\nRelated Courses: Server-Side Internet Programming, Coding and Big Data, Database System, Data\nStructures and Algorithms, Object Oriented and Visual Programming, Web Programming, Wireless and\nMobile Programming\nCapstone Project: Developed Audio Vision, a machine learning-based mobile application designed to assist\nvisually impaired users by detecting surrounding objects and navigating them to specified locations. Utilized\ncomputer vision and object detection algorithms to enable real-time feedback, enhancing user\nindependence and accessibility.\nBangkit Academy 2023 led by Google, Tokopedia, Gojek & Traveloka\nCentral Jakarta, Indonesia\nIndonesia (Remote)\nFebruary – July 2023\nSuccessfully built a cloud-based mobile application that leverages GCP for deployment, ensuring scalability\nand reliability. Led the back-end development using Node.js, implementing robust server-side logic and\nAPIs to support app functionality and optimize performance.\nDeveloped in-depth knowledge of Google Cloud Platform (GCP) and demonstrated proficiency in deploying\nand managing cloud-based applications with scalability, reliability, and security\nAchieved 7 certifications from Google Coursera and Dicoding Indonesia including Google Cloud Skill Boost,\nSystem Administration and IT Infrastructure Services, The Bits and Bytes of Computer Networking, Become\na Google Cloud Engineer, Build Back-End Applications with Google Cloud, Web Development, JavaScript\nProgramming",
  "projects": "AudioVision: Real-Time Object Detection Mobile App see project\nLed the full development cycle, including planning, design, model training, coding, testing, and deployment.\nImplemented machine learning algorithms using YOLOv8 and TensorFlow Lite for real-time object detection.\nIntegrated Google Maps API, Directions API, and Places API from Google Cloud Platform (GCP) for\nadvanced route guidance and location services.\nDeveloped an auditory guidance system providing clear and effective navigation instructions, enabling users\nto reach their destinations successfully\nImplemented real-time location sharing and tracking features using Firebase, ensuring precise and reliable\nlocation information for users and their contacts.\nImplemented voice commands feature for hands-free operation, enhancing accessibility and ease of use.",
  "technology": ": PHP, MySQL, Bootstrap\nCERTIFICATES & SKILLS\nGoogle Cloud Skill Boost, Google, Mar 2023 see certificates\nSystem Administration and IT Infrastructure Services, Google, Mar 2023 see certificates\nThe Bits and Bytes of Computer Networking, Google, Mar 2023 see certificates\nBecome a Google Cloud Engineer, Dicoding Indonesia, May 2023 see certificates\nJavaScript Programming, Dicoding Indonesia, Mar 2023 see certificates\nBuild Back-End Applications with Google Cloud, Dicoding Indonesia, Mar 2023 see certificates\nWeb Development, Dicoding Indonesia, Mar 2023 see certificates\nHard Skills: Dart, JavaScript, PHP, C#, VB, SQL, MySQL, SQL Server, SQFLite, Node.js, Express.js,\nASP.NET, Laravel, Flutter, React, Firebase, Google Cloud Platform (GCP), Docker, Git, Power BI,\nTensorFlow Lite, Machine Learning.\nSoft Skills: Leadership, Collaboration, Problem-Solving, Project Management, Adaptability, Attention to\nDetail, Communication, Time Management.",
  "skills": ": PHP, MySQL, Bootstrap\nCERTIFICATES & SKILLS\nGoogle Cloud Skill Boost, Google, Mar 2023 see certificates\nSystem Administration and IT Infrastructure Services, Google, Mar 2023 see certificates\nThe Bits and Bytes of Computer Networking, Google, Mar 2023 see certificates\nBecome a Google Cloud Engineer, Dicoding Indonesia, May 2023 see certificates\nJavaScript Programming, Dicoding Indonesia, Mar 2023 see certificates\nBuild Back-End Applications with Google Cloud, Dicoding Indonesia, Mar 2023 see certificates\nWeb Development, Dicoding Indonesia, Mar 2023 see certificates\nHard Skills: Dart, JavaScript, PHP, C#, VB, SQL, MySQL, SQL Server, SQFLite, Node.js, Express.js,\nASP.NET, Laravel, Flutter, React, Firebase, Google Cloud Platform (GCP), Docker, Git, Power BI,\nTensorFlow Lite, Machine Learning.\nSoft Skills: Leadership, Collaboration, Problem-Solving, Project Management, Adaptability, Attention to\nDetail, Communication, Time Management.Google Cloud Skill Boost, Google, Mar 2023 see certificates\nSystem Administration and IT Infrastructure Services, Google, Mar 2023 see certificates\nThe Bits and Bytes of Computer Networking, Google, Mar 2023 see certificates\nBecome a Google Cloud Engineer, Dicoding Indonesia, May 2023 see certificates\nJavaScript Programming, Dicoding Indonesia, Mar 2023 see certificates\nBuild Back-End Applications with Google Cloud, Dicoding Indonesia, Mar 2023 see certificates\nWeb Development, Dicoding Indonesia, Mar 2023 see certificates\nHard Skills: Dart, JavaScript, PHP, C#, VB, SQL, MySQL, SQL Server, SQFLite, Node.js, Express.js,\nASP.NET, Laravel, Flutter, React, Firebase, Google Cloud Platform (GCP), Docker, Git, Power BI,\nTensorFlow Lite, Machine Learning.\nSoft Skills: Leadership, Collaboration, Problem-Solving, Project Management, Adaptability, Attention to\nDetail, Communication, Time Management."
}